Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/K32.tmx
Source language: en_us
Languages: zh_cn

source: Drinking coffee elsewhere
zh_cn: 去别处喝咖啡

source: Orientation games began the day I arrived at Yale from Baltimore.
zh_cn: 我从巴尔的摩来到耶鲁大学的头一天，学校里安排了游戏活动来帮我们适应新环境。

source: In my group we played heady, frustrating games for smart people.
zh_cn: 我们小组玩的都是用来打击聪明人的刺激游戏。

source: One game appeared to be charades reinterpreted by existentialists; another involved listening to rocks.
zh_cn: 有存在主义者重新设计过的猜字游戏；也有听摇滚乐。

source: Then a freshman counsellor made everyone play Trust. The idea was that if you had the faith to fall backward and wait for four scrawny former high-school geniuses to catch you, just before your head cracked on the slate sidewalk, then you might learn to trust your fellow-students.
zh_cn: 随后新生辅导员要大家玩“信任”：如果你够胆朝后倒，在你的脑袋亲吻石板人行道之前，你身后这帮皮包骨的前高中天才们会接住你，这就意味着你学会了信任自己的同学。

source: Russian roulette sounded like a better game.
zh_cn: 我宁愿去玩俄罗斯轮盘赌。

source: No way, I said.
zh_cn: “门都没有，”我说道。

source: The white boys were waiting for me to fall, holding their arms out for me, sincerely, gallantly. "No fucking way."
zh_cn: 白人男孩们殷勤地伸着手，实心实意地等着我倒过去，“我他妈的可不玩这个。”

source: It's all cool, it's all cool, the counsellor said.
zh_cn: “没关系的，不玩就不玩，”辅导员说道。

source: Her hair was a shade of blond I'd seen only on Playboy covers, and she raised her hands as though backing away from a growling dog. "Sister," she said, in an I'm-down-with-the-struggle voice, "you don't have to play this game.
zh_cn: 她的头发是一种我只在《花花公子》封面才看到过的金黄色。她举着双手，好像要逃离一只正在咆哮的恶狗，“这位女同学，”她的声音里充满了我-可-不想-争论-下去了的意味，“你不是非玩这个游戏不可。

source: As a person of color, you shouldn't have to fit into any white, patriarchal system."
zh_cn: 黑人学生不需要勉强自己融入任何白人家长式的体系。”

source: I said, "It's a bit too late for that."
zh_cn: 我嘲讽道：“现在说这个，恐怕有点晚了吧。”

source: In the next game, all I had to do was wait in a circle until it was my turn to say what inanimate object I wanted to be.
zh_cn: 下一个游戏中，我们坐成一圈，我只需等着，等轮到我说出自己想做什么无生命的物体。

source: One guy said he'd like to be a gadfly, like Socrates.
zh_cn: 一个男生说，他想做牛虻，像苏格拉底一样。

source: "Stop me if I wax Platonic," he said.
zh_cn: 他说：“如果这样子显得太过柏拉图，制止我吧。”

source: The girl next to him was eating a rice cake. She wanted to be the Earth, she said.
zh_cn: 他旁边的女孩在吃一块年糕，她说她想做地球。

source: Earth with a capital "E."
zh_cn: 以大写字母E开头的地球。

source: There was one other black person in the circle.
zh_cn: 圈子里还有一个黑人学生。

source: He wore an Exeter T-shirt and his overly elastic expressions resembled a series of facial exercises.
zh_cn: 他穿件艾克赛特T恤衫，表情非常有弹性，就好像在做脸部瑜伽似地。

source: At the end of each person's turn, he smiled and bobbed his head with unfettered enthusiasm.
zh_cn: 每个人说完后，他都微笑着，头点得像小鸡啄米，毫不掩饰自己的热情。

source: "Oh, that was good," he said, as if the game were an experiment he'd set up and the results were turning out better than he'd expected. "Good, good, good!"
zh_cn: “噢，这个不错，”他说，好像这游戏是他设计的实验，而实验结果比他预期的要好：“不错，相当不赖。”

source: When it was my turn I said, "My name is Dina, and if I had to be any object, I guess I'd be a revolver."
zh_cn: 轮到我的时候，我说：“我叫狄娜，如果非得要选一样的话，我想我会做左轮手枪。”

source: The sunlight dulled as if on cue.
zh_cn: 太阳的光芒似乎应声而暗。

source: Clouds passed rapidly overhead, presaging rain.
zh_cn: 天上的云团快速地飘过我们的头顶，大概快要下雨了。

source: I don't know why I said it.
zh_cn: 我不知道自己为什么这么说。

source: Until that moment I'd been good in all the ways that were meant to matter.
zh_cn: 此时此刻之前，在一切重要的事情上，我一直表现的很好。

source: I was an honor-roll student - though I'd learned long ago not to mention it in the part of Baltimore where I lived.
zh_cn: 我是学校的优等生，尽管很早以前我就意识到，在我家所在的巴尔的摩的那一区，最好不要提什么优等生之类的事。

source: Suddenly I was hard-bitten and recalcitrant, the kind of kid who took pleasure in sticking pins into cats; the kind who chased down smart kids to spray them with mace.
zh_cn: 可那一刻，我变成了一个倔强反叛的孩子：就是会把大头针摁进小猫身体来取乐的那种；或者追赶聪明孩子，往他们脸上喷催泪麦斯的那种。

source: A revolver, a counsellor said, stroking his chin, as if it had grown a rabbinical beard. "Could you please elaborate?"
zh_cn: “左轮手枪，”另一个辅导员重复道，摸着他的下巴，好像那里长着一把希伯来胡子似地：“你能说得详细些吗？”

source: The black guy cocked his head and frowned, as if the beakers and Erlenmeyer flasks of his experiment had grown legs and scurried off.
zh_cn: 那个黑人男生歪着头，皱起了眉头，似乎他实验中的烧杯和锥形杯不但长出了腿，还跑掉了。

source: You were just kidding, the dean said, "about wiping out all of mankind.
zh_cn: “你不过是在开玩笑吧，”系主任说：“说要消灭全人类。

source: That, I suppose, was a joke."
zh_cn: 我想，这个说法不过是玩笑话吧。”

source: She squinted at me. One of her hands curved atop the other to form a pink, freckled molehill on her desk.
zh_cn: 她瞥着我，两只有雀斑的手交叉在桌面上，好像一座粉红色的小山丘。

source: Well, I said, "maybe I meant it at the time."
zh_cn: “这个嘛，”我说：“也许当时我是当真的。”

source: I quickly saw that that was not the answer she wanted.
zh_cn: 我很快发现这可不是她想要的答案。

source: "I don't know. I think it's the architecture."
zh_cn: “我也不知道，也许是建筑物的关系吧。”

source: Through the dimming light of the dean's-office window, I could see the fortress of the old campus.
zh_cn: 系主任办公室的窗外，光线已经暗了下来，我可以看到古老校园里的城堡。

source: On my ride from the bus station to the campus, I'd barely glimpsed New Haven - a flash of crumpled building here, a trio of straggly kids there.
zh_cn: 在我从汽车站坐车来学校的路上, 我只不过远远地瞥了一眼纽黑文—一片破破烂烂的房子，三五个乱糟糟的小孩。

source: A lot like Baltimore.
zh_cn: 和巴尔的摩差不多。

source: But everything had changed when we reached those streets hooded by the gothic buildings.
zh_cn: 可当我们到了耶鲁，看到那些被哥特式建筑包围的街道，一切就都不一样了。

source: I imagined how the college must have looked when it was founded, when most of the students owned slaves.
zh_cn: 我想象着学校初建时是什么模样，那时大部分学生还拥有奴隶。

source: I pictured men wearing tights and knickers, smoking pipes.
zh_cn: 我眼前浮现出穿着紧身上衣和灯笼裤，嘴里抽着烟斗的男人们。

source: The architecture, the dean repeated.
zh_cn: “建筑物，”系主任重复着。

source: She bit her lip and seemed to be making a calculation of some sort.
zh_cn: 她咬着自己的嘴唇，好像在做计算题。

source: I noticed that she blinked less often than most people.
zh_cn: 我发现她眨眼的次数比大多数人都要少。

source: I sat there, waiting to see how long it would be before she blinked again.
zh_cn: 我坐在那里，等着看还要多久她才会再次眨眼。

source: My revolver comment won me a year's worth of psychiatric counselling, weekly meetings with Dean Guest, and - since the parents of the roommate I'd never met weren't too hip on the idea of their Amy sharing a bunk bed with a budding homicidal loony - my very own room.
zh_cn: “左轮手枪”为我赢得了一年的心理辅导，每周和系主任盖斯特的面谈，以及我的单人宿舍：室友连面都没露，她的父母不太中意让自己的艾米和一个未来的杀人狂分享上下铺。

source: Shortly after getting my first D, I also received the first knock on my door.
zh_cn: 在我拿了第一个D之后不久，第一次有人敲响了我的房门。

source: The female counsellors never knocked.
zh_cn: 女生辅导员们从来不敲门。

source: The dean had spoken to them; I was a priority.
zh_cn: 系主任和她们交代过了，要特别关照我。

source: Every other day, right before dinnertime, they'd look in on me, unannounced.
zh_cn: 每隔一天，正正好在吃晚饭前，她们会来看看我，偷偷摸摸地。

source: "Just checking up," a counsellor would say.
zh_cn: “只是来看看，”辅导员会这么说。

source: It was the voice of a suburban mother in training.
zh_cn: 这是一个郊区妈妈的声音。

source: By the second week, I had made a point of sitting in a chair in front of the door, just when I expected a counsellor to pop her head around. This was intended to startle them.
zh_cn: 到第二周，我估计辅导员会探头进来时，就坐在门前的椅子里，好吓她一跳。

source: I also made a point of being naked.
zh_cn: 我还试了试不穿衣服。

source: The unannounced visits ended.
zh_cn: 这才终结了这些鬼鬼祟祟的查看。

source: The knocking persisted.
zh_cn: 敲门声继续着。

source: Through the peephole I saw a white face, distorted and balloonish.
zh_cn: 透过猫眼，我看到一张白人的脸：扭曲着，肿肿的。

source: Let me in. The person looked like a boy but sounded like a girl.
zh_cn: “让我进来。”这个人看上去像个男孩，不过听上去又像个女孩。

source: "Let me in," the voice repeated.
zh_cn: “让我进来，”她重复道。

source: Not a chance, I said.
zh_cn: “不行，”我说。

source: Then the person began to sob, and I heard a back slump against the door.
zh_cn: 然后这个人哭了起来，我听到她的后背顺着门滑了下去。

source: If I hadn't known the person was white from the peephole, I'd have known it from a display like this.
zh_cn: 如果我没有在猫眼里看到这是个白人，那么我也会从这些表现中猜出来。

source: Black people didn't knock on strangers' doors, crying. Not that I understood the black people at Yale. There was something pitiful in how cool they were.
zh_cn: 我们黑人从不会哭着去敲陌生人的门，虽然我不太了解读耶鲁的黑人学生们：他们都表现得很酷，可他们的潇洒中却不无令人可怜的成分。

source: Occasionally one would reach out to me with missionary zeal, but I'd rebuff that person with haughty silence.
zh_cn: 时不时地，他们当中会有人带着传教士般的热情来对我表示友好。我却总是冷冷地不发一言。

source: I don't have anyone to talk to! the person on the other side of the door cried.
zh_cn: “我找不到可以谈心的人。”

source: That is correct.
zh_cn: “这就对了。”

source: When I was a child, the person said, "I played by myself in a corner of the schoolyard all alone.
zh_cn: “当我还是个孩子时，”那个人说道：“我一个人在校园的角落里玩耍。

source: I hated dolls and I hated games, animals were not friendly and birds flew away.
zh_cn: 我讨厌洋娃娃，也不喜欢玩游戏。动物们不友好，鸟儿也总是飞走。

source: If anyone was looking for me I hid behind a tree and cried out 'I am an orphan - ' "
zh_cn: 如果有人来找我，我藏在大树后，大声说：‘我是孤儿——’”

source: I opened the door.
zh_cn: 我打开房门。

source: It was a she.
zh_cn: 是个她。

source: Plagiarist!
zh_cn: “抄袭猫！”

source: I yelled.
zh_cn: 我嚷嚷道。

source: She had just recited a Frank O'Hara poem as though she'd thought it up herself.
zh_cn: 她刚刚好像在自言自语，其实她在背诵弗兰克·奥哈拉的一首诗。

source: I knew the poem because it was one of the few things I'd been forced to read that I wished I'd written myself.
zh_cn: 我知道这首诗：在我被逼着所读过的不多的东西中，唯有这首诗，我希望是我写的。

source: The girl turned to face me, smiling weakly, as though her triumph were not in getting me to open the door but in the fact that she was able to smile at all when she was so accustomed to crying.
zh_cn: 那个女孩转过身来面对着我，虚弱地微笑着，好像她的胜利并不在于逼得我开了房门，而在于她已经哭成习惯后还能笑得出来。

source: She was large but not obese, and crying had turned her face the color of raw chicken.
zh_cn: 她块头不小，但并不算大胖子，哭泣把她的脸变成了生鸡肉的颜色。

source: She blew her nose into the waist end of her T-shirt, revealing a pale belly.
zh_cn: 她拉起T恤衫，用下方擤了擤鼻涕，露出了苍白的肚皮。

source: How do you know that poem?
zh_cn: “你怎么知道这首诗？”

source: She sniffed. "I'm in your Contemporary Poetry class."
zh_cn: 她抽抽鼻子：“我也在上现代诗歌课。”

source: She was Canadian and her name was Heidi, although she said she wanted people to call her Henrik.
zh_cn: 她是加拿大人，叫海蒂。尽管她说希望人们叫她亨里克。

source: "That's a guy's name," I said. "What do you want? A sex change?"
zh_cn: “那是男生的名字，”我说：“怎么着, 你想变性吗？”

source: She looked at me with so little surprise that I suspected she hadn't discounted this as an option.
zh_cn: 她毫不吃惊地看着我，我怀疑她并没有不把这个建议当回事。

source: Then her story came out in teary, hiccup-like bursts.
zh_cn: 随后，她哭哭啼地地讲了自己的故事。

source: She had sucked some "cute guy's dick" and he'd told everybody and now people thought she was "a slut."
zh_cn: 她给一个“可爱的家伙”做了口交，而他告诉了所有人。现在，大家伙都认为她是个“贱货”。

source: Why'd you suck his dick? Aren't you a lesbian?
zh_cn: “你为什么为他口交？你不是拉拉吗？”

source: She fit the bill. Short hair, hard, roach-stomping shoes. Dressed like an aspiring plumber.
zh_cn: 她符合拉拉的一些定义：短头发，硬邦邦的鞋子，穿得像个胸怀大志的管道工人。

source: The lesbians I'd seen on TV were wiry, thin strips of muscle, but Heidi was round and soft and had a moonlike face.
zh_cn: 我在电视上看到的拉拉都又瘦又结实，肌肉一条条的。可海蒂圆乎乎的，脸像满月一样。

source: And lesbians had cats.
zh_cn: 同性恋者都养猫。

source: "Do you have a cat?" I asked.
zh_cn: “你有猫吗？”我问她。

source: Her eyes turned glossy with new tears.
zh_cn: 眼泪又来了，她的眼睛变得亮晶晶的。

source: "No," she said, her voice wavering, "and I'm not a lesbian.
zh_cn: “我没有，”她说，声音颤抖着，“我也不是拉拉。

source: Are you?"
zh_cn: 你是吗？”

source: Do I look like one? I said.
zh_cn: “我看着像吗？”我说。

source: She didn't answer.
zh_cn: 她没回答。

source: O.K. I said. "I could suck a guy's dick, too, if I wanted.
zh_cn: “好啦，”我说：“如果我想的话，我也会给男人口交的。

source: But I don't.
zh_cn: 不过我没这么做。

source: The human penis is one of the most germ-ridden objects there is."
zh_cn: 阴茎是人体细菌最多的部位之一。”

source: Heidi looked at me, unconvinced.
zh_cn: 海蒂看着我，一脸不相信的样子。

source: "What I meant to say," I began again, "is that I don't like anybody.
zh_cn: “我想说的是，”我接着说：“我不喜欢任何人。

source: Period.
zh_cn: 句号。

source: Guys or girls.
zh_cn: 无论男女。

source: I'm a misanthrope."
zh_cn: 我是个厌恶人类者。”

source: I am, too.
zh_cn: “我也是。”

source: No, I said, guiding her back through my door and out into the hallway. "You're not."
zh_cn: “不，”我边说边把她领出我的房门，来到走廊：“你不是。”

source: Have you had dinner? she asked. "Let's go to Commons."
zh_cn: “你吃过晚饭了吗？”她问道：“咱们一起去大饭堂吧。”

source: I pointed to a pyramid of ramen-noodle packages on my windowsill. "See that?
zh_cn: 我指着窗台上堆得像金字塔似的方便拉面，“看到了吗？

source: That means I never have to go to Commons.
zh_cn: 有了它们，我就永远不需要去大饭堂。

source: Aside from class, I have contact with no one."
zh_cn: 除了上课之外，我不和人打交道。”

source: I hate it here, too, she said.
zh_cn: “我也不喜欢这里。”

source: "I should have gone to McGill, eh."
zh_cn: 她说：“我应该去上麦吉尔大学的。”

source: The way to feel better, I said, "is to get some ramen and lock yourself in your room.
zh_cn: “想好过一点吗？”我说道：“去买一堆拉面，然后把自己锁在房间里。

source: Everyone will forget about you and that guy's dick and you won't have to see anyone ever again. If anyone looks for you - "I'll hide behind a tree.
zh_cn: 大家会忘了你，忘了那个家伙的老二。你不用见任何人，如果有人来找你——”“我就藏到树后面去。”

source: A revolver?
zh_cn: “左轮手枪？”

source: Dr. Raeburn said, flipping through a manila folder.
zh_cn: 雷伯恩博士边说边快速地翻看着手中的黄色文件夹。

source: He looked up at me as if to ask another question, but he didn't.
zh_cn: 他抬头看看我，似乎要问另一个问题，但又没开口。

source: Dr. Raeburn was the psychiatrist.
zh_cn: 雷伯恩博士是学校为我安排的心理医生。

source: He had the gray hair and whiskers of a Civil War general.
zh_cn: 他有着灰白的头发，胡子像内战时的将军。

source: He was also a chain smoker with beige teeth and a navy wool jacket smeared with ash.
zh_cn: 他的烟瘾很大，牙齿黄黄的，海军蓝羊毛夹克衫上经常有烟灰，脏兮兮的。

source: He asked about the revolver at the beginning of my first visit.
zh_cn: 他在我第一次来时问起了左轮手枪。

source: When I was unable to explain myself he smiled, as if this were perfectly respectable.
zh_cn: 在我无法解释自己的时候，他笑了，好像这一点完全值得尊敬。

source: Tell me about your parents.
zh_cn: “谈谈你的父母吧。”

source: I wondered what he already had on file. The folder was thick, though I hadn't said a thing of significance since Day One.
zh_cn: 我很纳闷那个文件夹上都写了些什么，厚厚的一摞，要知道自从我来到这里的头一天起，就一句要紧话都没说过。

source: My father was a dick and my mother seemed to like him.
zh_cn: “我父亲是个混蛋，不过我妈妈似乎很喜欢他。”

source: He patted his pockets for his cigarettes.
zh_cn: 他拍拍自己的口袋，想找烟抽。

source: "That's some heavy stuff," he said. "How do you feel about Dad?"
zh_cn: “很沉重，”他说：“你对爸爸是什么感觉？”

source: The man couldn't say the word "father."
zh_cn: 这个人说不出“父亲”这个词。

source: "Is Dad someone you see often?"
zh_cn: “你经常见到你爸吗？”

source: I hate my father almost as much as I hate the word 'Dad.'
zh_cn: “我痛恨我父亲，和我痛恨‘爸爸’这个词一样。”

source: He started tapping his cigarette.
zh_cn: 他开始敲着他的香烟。

source: You can't smoke in here.
zh_cn: “你不能在这里抽烟。”

source: That's right, he said, and slipped the cigarette back into the packet.
zh_cn: “你说得对，”他说，把香烟又放回了口袋。

source: He smiled, widening his eyes brightly. "Don't ever start."
zh_cn: 他微笑着，眼睛睁得大大地：“一只也不抽。”

source: I thought that that first encounter would be the last of Heidi, but then her head appeared in a window of Linsly-Chit during my Chaucer class. Next, she swooped down a flight of stairs in Harkness.
zh_cn: 原以为和海蒂的第一次碰面也会是最后一次，但我在林斯利-奇藤登会堂上我的乔叟诗歌课时，她在外面探头探脑；随后她从哈克尼斯大楼的楼梯上猛冲下来。

source: She hailed me from across Elm Street and found me in the Sterling Library stacks.
zh_cn: 她在榆树街上和我打招呼，又在斯特林图书馆的书架前找到我。

source: After one of my meetings with Dr. Raeburn, she was waiting for me outside Health Services, legs crossed, cleaning her fingernails.
zh_cn: 有一次我见完雷伯恩博士后，走出校医院，看到她边清理自己的指甲，边等着我。

source: You know, she said, as we walked through Old Campus, "you've got to stop eating ramen. Not only does it lack a single nutrient but it's full of MSG."
zh_cn: “我说，”她边和我走过老校园边说：“你可不能再吃方便拉面了，不光毫无营养，还含有过多的味精。”

source: I like eating chemicals," I said. "It keeps the skin radiant."
zh_cn: “我喜欢吃味精，”我说道：“它们使我容光焕发。”

source: There's also hepatitis.
zh_cn: “还有肝炎呐。”

source: She already knew how to get my attention - mention a disease.
zh_cn: 她已经知道怎样引起我的注意力了—谈论疾病。

source: You get hepatitis from unwashed lettuce, I said. "If there's anything safe from the perils of the food chain, it's ramen."
zh_cn: “吃了没洗干净的生菜才会得肝炎呐，”我说：“如果说还有一样食品是安全的，还没有被食物链污染，那就是方便拉面啦。”

source: But you refrigerate what you don't eat.
zh_cn: “但是你得把没吃的拉面放进冰箱。

source: Each time you reheat it, you're killing good bacteria, which then can't keep the bad bacteria in check.
zh_cn: 每次重新加热的时候，就会杀死里面的有益细菌，这样一来，有益的细菌就不能克制住有害的细菌。

source: A guy got sick from reheating Chinese noodles, and his son died from it.
zh_cn: 有个家伙吃了重新加热的中国面条就病倒了，他的儿子还因此丢了小命。

source: I read it in the Times.
zh_cn: 我在《纽约时报》上读到的。”

source: With this, she put a jovial arm around my neck.
zh_cn: 说到这里，她快活地把一条胳膊环过我的脖子。

source: I continued walking, a little stunned.
zh_cn: 我继续走着，有点儿被吓到了。

source: Then, just as quickly, she dropped her arm and stopped walking.
zh_cn: 然后，她很快地把自己的胳膊拿开，停了下来。
